<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas12.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
job_list = [{'name':'John','job':'teacher'},
           {'name':'Nate','job':'teacher'},
           {'name':'Fred','job':'teacher'},
           {'name':'Abraham','job':'student'},
           {'name':'Brian','job':'student'},
           {'name':'Janny','job':'developer'},
           {'name':'Nate','job':'teacher'},
           {'name':'Ian','job':'teacher'},
           {'name':'chris','job':'banker'},
            {'name':'Philip','job':'lawyer'},
            {'name':'Janny','job':'basketball player'},
            {'name':'Gwen','job':'teacher'},
            {'name':'Jessy','job':'student'}
           ]
df =pd.DataFrame(job_list,columns = ['name','job'])

In [ ]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7       Ian            teacher
8     chris             banker
9    Philip             lawyer
10    Janny  basketball player
11     Gwen            teacher
12    Jessy            student

유니크 값 추출

In [ ]:
df.job.unique()

array(['teacher', 'student', 'developer', 'banker', 'lawyer',
       'basketball player'], dtype=object)

유니크 값 갯수 확인

In [ ]:
df.job.value_counts()

teacher              6
student              3
basketball player    1
lawyer               1
banker               1
developer            1
Name: job, dtype: int64